["Here is the list of the new features and enhancements. Improve the Active directory v1 to v2 Migration Migrating from Active Directory V1 to V2 now ensures a clean resync; automatically removing out-of-scope users and groups. If reverted back to V1, a fresh resync is triggered for consistency.", "Alerts Data Collection The following enhancements are included with this release: In the ‘Alerts’ data collection, a new attribute ‘ Malsite Severity ‘ is added to provide consistency across Advanced Analytics and Skope IT alerts. The previous attribute is now renamed to 'Malsite Severity (Deprecated)' and will be retired. For any dashboards in the Personal or Group folders, manually remove and replace the deprecated attribute with the updated attribute. Any predefined dashboards from the Netskope Library with this attribute is replaced with the new ‘ Malsite Severity ‘.", "Major New Features DSPM for Salesforce (SFDC) Netskope One DSPM now offers the capability to scan Salesforce (SFDC) content libraries, allowing for the classification of documents and the discovery of sensitive data. This expanded coverage for SFDC significantly enhances visibility into sensitive data in a critical business application. It’s important to note that only data classification will be performed, with risk assessment to be delivered in later phases. The Salesforce Classic version will not be supported, and we will only scan the “Owned by me library.” Configuration & Privilege Analysis for On-Premises IBM Db2 Netskope One DSPM now offers the capability to perform Configuration Analysis and Deep Privilege Analysis for on-premises IBM Db2 data stores. This new functionality provides valuable insights into the security posture of your IBM Db2 instances, including misconfiguration risks and who has access to sensitive data. This expanded coverage significantly enhances visibility into data risks within on-premises environments. Support for custom DLP Profiles and Rules in DSPM for SaaS Applications DSPM for SaaS Applications now supports the ability to select custom DLP Profiles & Rules to scan against your SaaS applications. Now you can enable / disable any type of DLP Profile, regardless of type (pre-defined or custom). For your existing connections, you can update your selected profiles, and changes will take effect at the next scan.", "We are excited to announce our recent updates on the product! Get the features, issues fixed, and other updates published in the month of November, i.e. in 25.11 version release notes. Release Notes Subscription Would you like to subscribe to our release notes? To learn more: Release Notes Subscription .", "The following is a list of Digital Experience Management (DEM) releases for the month of November 2025: Client Steering Widget Datasource Improvement Enhancements have been made to the datasources powering the “Active Device Count by POP” and “Active Device Count By POP Per Hour” widgets within the DEM Client Steering dashboard. Fixed Issue There was an issue with the DEM User Drill Down dashboard. It would show devices of the user that are not DEM-enabled, apart from DEM-enabled devices. This issue has been fixed.", "Published on: December 10, 2025 We are excited to announce our release updates! Get the latest features, issues fixed, and other updates in this release. Though this release does not have any notable new features and enhancements, it includes internal bug fixes. Release Notes Subscription Would you like to subscribe to our release notes? To learn more: Release Notes Subscription . Upcoming Product Changes To preview some of what's coming in the next release, see: Product Change Notification .", "Here is the list of fixed issues in this release. Issue Number Category Description 801565, 786556 Netskope Client Steering Fixed an issue for Netskope Client for Windows where the Client tunnel kept disconnecting or the Client services stopped. Note The fix is released as part of release version 133.0.4 and is backported to version 132.0.13. 820999 Fixed an issue where Netskope Client upgrade failed when updating 64-bit packages on Windows Server. Note The fix is released as part of release version 133.0.4 and is backported to versions 132.0.13.", "UI/UX Enhancements Enhanced UI/UX with improved navigation, filters, table views, log display, and UI buttons consistency. Added a new guided tour for all modules, along with a tenant configuration tour. Added page description, model headers, tooltip with markdown support, and clickable breadcrumbs across different pages. Enhanced UI performance by performing UI build optimization that results in a reduced page loading time and improves user experience. Enhanced modules dashboard will have clickable data that will redirect you to more details. Added a dashboard to view CPU, RAM, disk usage per VM/node for HA + Standalone deployment, and pending task count in RabbitMQ, which helps you to identify Cloud Exchange backlog. HA Improvements Added UI-based High Availability (HA) deployment and management of Nodes which includes start/stop of node, restart of node and removal of node. Enhanced storing of HA configuration details in the .env file which makes smooth manageability. Added built-in GlusterFS with HA support for shared storage within Cloud Exchange nodes, removing the need for external shared storage (NFS, Other File shares). Shared storage (GlusterFS) installation and configuration is now managed by the server with built-in HA, reducing administrator effort. During Containerised HA deployment, the VM should have connectivity to the ubuntu PPA repository to download GlusterFS. Upgrade of Cloud Exchange using Debian package in Cloud Exchange as a VM will require you to install GlusterFS as part of the prerequisites. Added support of migration from HA deployment to standalone deployment. Cloud Exchange Improvements Improved the Cloud Exchange Log Shipper Module performance. A Cloud Exchange v6.0 Medium instance will now support 200k EPM in the Log Shipper Module. Large instance performance will also increased. Added a CPU/RAM/Disk Usage monitoring dashboard. Analytics/Diagnostics Added Cloud Exchange uptime details in the user-agent to track Cloud Exchange deployment uptime. Added plugin parameters/configuration details in a", "performance. A Cloud Exchange v6.0 Medium instance will now support 200k EPM in the Log Shipper Module. Large instance performance will also increased. Added a CPU/RAM/Disk Usage monitoring dashboard. Analytics/Diagnostics Added Cloud Exchange uptime details in the user-agent to track Cloud Exchange deployment uptime. Added plugin parameters/configuration details in a diagnostic script to enhance troubleshooting. Enhanced analytics to Module-based user-agent analytics to have move information. Added platform details (slack, emails, etc) in analytics for plugins like Notifier, Webhook, etc. Added Core UI Added an Exact Data Match (EDM) Beta module that is designed to retrieve data files from configured sources at specified time intervals and securely share them with your Netskope Tenant for use with the EDM feature for creating custom Data Loss Prevention (DLP) rules. This module is only supports Standalone container-based deployment on RHEL and Ubuntu. Added a Custom File Classification (CFC) Beta module that is designed to retrieve files from configured sources and train the custom classifier configured on the Netskope Tenant. This module is only supports Standalone container-based deployment on RHEL and Ubuntu. Note that after upgrading to Cloud Exchange v6.0.0, Cloud Exchange users need to fetch plugin updates from the default repository in order to configure the EDM and CFC plugins. Introduced a Cloud Exchange Management Server VM service, running on a host machine to facilitate VM resource monitoring, proxy updates, HA setup, and Management using TLS communication. Added support of password-protected custom SSL certs that are used for the Cloud Exchange UI. Added support for Cloud Exchange deployment on KVM through a QCOW2 Image. Added Ticket Orchestrator Webhook support that updates tickets status, severity, and assignee back to Cloud Exchange using a dedicated plugin update. (Slack-Notifier Plugin) Added a manual approval workflow for Ticket Orchestrator tickets creation. Added custom status and severity support in", "for Cloud Exchange deployment on KVM through a QCOW2 Image. Added Ticket Orchestrator Webhook support that updates tickets status, severity, and assignee back to Cloud Exchange using a dedicated plugin update. (Slack-Notifier Plugin) Added a manual approval workflow for Ticket Orchestrator tickets creation. Added custom status and severity support in the Ticket Orchestrator module, and simplified the mapping workflow in the Ticket Orchestrator module. Added support of business rule filtering for Cloud Exchange logs. Added Ubuntu 24 as a supported base OS for container-based deployment. Added an automated source field value learning in value map type fields in the Risk Exchange schema editor that can be used by the end user to map target fields. Added Total Events Queried Count and Recent Events details in the Ticket Orchestrator Dashboard. Added support to migrate plugin configurations from the beta repo to GA through a UI button if the same or a higher version is available in the GA repo. Added support to modify Cloud Exchange users password policy under Settings > Users Settings > Password Policy . Added support for dynamic fields that render new input fields based on current field values. Added a revert action workflow where you can choose multiple actions and revert them in the Risk Exchange Module. The latest Netskope Risk Exchange Plugin targets marking UCI impact action as an anomaly using this workflow. Changed Core UI Enhanced the Cloud Exchange setup workflow by reducing inputs and also introduce a cloudexchange.config file to simplify custom configuration inputs, such as UI port, protocol, maintenance password, etc. If the file is not present, the setup script now applies best-fit default values and auto-generates password configurations without asking for CLI inputs. Enhanced the proxy configuration to be managed directly from the Cloud Exchange UI without requiring setup and stop/start scripts.", "such as UI port, protocol, maintenance password, etc. If the file is not present, the setup script now applies best-fit default values and auto-generates password configurations without asking for CLI inputs. Enhanced the proxy configuration to be managed directly from the Cloud Exchange UI without requiring setup and stop/start scripts. Added a Log Shipper Module warning log during ingestion of one batch if the ingestion time exceeds ideal time, which is 10 seconds. Enhanced inter-container communication by upgrading it to TLS-based communication. Core container to the RabbitMQ and MongoDB connection will be over TLS. Enhanced the Cloud Exchange Logging page by adding resolution steps that help you to resolve errors easily. Enhanced the setup script to flag an error if the CPU doesn’t support AVX, since its prerequisite. The Netskope Tenant plugin configuration will be mandatory to use any Cloud Exchange modules, and you will not be able to configure other plugins until the tenant plugin configuration is done successfully. Enhanced the diagnostic script to add plugin configuration details, indicators/alerts/events counts per plugin, and log ingestion/pulling counts that helps with troubleshooting issues faster. Introduced the cloudexchange.config file in order to provide custom inputs, like an SSL protected password, UI port, JWT secret, etc., during setup of Cloud Exchange. Enhanced plugin updates to display only the relevant release notes between the current and newer versions. Enhanced the value map type for string mapping support in Risk Exchange schema fields through which users can map string-to-string. Plugins Updates Netskope Threat Exchange Plugin workflow improvements based on updates to IoC severity and verdict from Netskope. The Threat Exchange plugin now integrates directly with the Netskope Retrohunt API. If an indicator is identified as a false positive, our system automatically uses the existing retraction workflow to pull/delete it from your active threat list. The", "workflow improvements based on updates to IoC severity and verdict from Netskope. The Threat Exchange plugin now integrates directly with the Netskope Retrohunt API. If an indicator is identified as a false positive, our system automatically uses the existing retraction workflow to pull/delete it from your active threat list. The Risk Exchange plugin will allow the undo functionality for the Update UCI Impact action supporting Mark Anomaly as allowed. Added UCI Reset and Delete App Tag actions support for Netskope Risk Exchange. EDM and CFC Beta Modules New Features and Enhancements The new Exact Data Match (EDM) and Custom File Classification (CFC) modules are currently in Beta. Added Core UI Plugins EDM Module: Added an RBAC for EDM module (Read and Write). Added APIs for managing EDM Plugins, Sharing and Management screens. Added a plugin configuration page along with step-wise validation to check the connectivity and pull sample data. Added a manual Upload workflow. Added support of Generating hashing for structured data using a Netskope hash generation script. Added capabilities for uploading EDM hashes to the Netskope Tenant using a Netskope Uploader script. Added Task to pull data from a configured source per the pull interval (Minimum 12 hrs). Added a task for sharing the generated EDM Hashes to the Netskope Tenant upon completion of hash generation. Added a task for polling the status of the uploaded EDM hashes to check the apply status and delete the staging file on success/failure. Added a task for cleaning the generated EDM hashes upon expiry. CFC Module: Added an RBAC for CFC module (Read and Write). Added APIs for managing CFC Plugins, File Metadata, Business Rules, Sharing, and Management screens. Added a plugin configuration page along with step-wise validation to check the connectivity and validate the file filters and number of files. Added", "upon expiry. CFC Module: Added an RBAC for CFC module (Read and Write). Added APIs for managing CFC Plugins, File Metadata, Business Rules, Sharing, and Management screens. Added a plugin configuration page along with step-wise validation to check the connectivity and validate the file filters and number of files. Added a Manual Upload workflow with multiple files and folder selection. Added support for hashing images/zip data using a Netskope Hashing script. Added a task for executing plugin lifecycle to pull file metadata, pull image(s)/file(s) if required. Added a task for hashing and sharing the pulled data based on the Sharing configuration, in which hashing depends on the selected Destination Tenant and Classifier. Added a task for cleaning the File metadata upon expiry. EDM Module: Added an RBAC for EDM module (Read and Write). Added a Plugins page to display configured EDM Plugins. Added step-wise validation and validation errors on fields along with a message. Added a sharing page to configure sharing between source and destination plugins. Added Sharing and an Upload Management screen to check hash generation status and the upload process. Added a manual Upload workflow page. Added a Settings page for the EDM to cleanup the hashes. CFC Module: Added an RBAC for CFC module (Read and Write). Added a Plugins page to display configured CFC Plugins. Added step-wise validation and validation errors on fields along with a message. Added a File Metadata page to check details on pulled file metadata along with filtering capabilities. Added business rules to filter out files using files metadata. Added a sharing page to configure sharing between source and destination plugins, along with file classifier and training type. Added a Sharing and Upload Management page. Added a Manual Upload workflow with multiple files/folder support for Hash generation, and Upload for the same", "to filter out files using files metadata. Added a sharing page to configure sharing between source and destination plugins, along with file classifier and training type. Added a Sharing and Upload Management page. Added a Manual Upload workflow with multiple files/folder support for Hash generation, and Upload for the same to Netskope Tenant. Added a Settings page for the CFC to cleanup the File Metadata. 3rd Party Plugins: Microsoft Fileshare EDM Plugin Microsoft SQL EDM Plugin Linux Fileshare EDM Plugin MySQL EDM Plugin OracleDB EDM Plugin Microsoft Fileshare CFC Plugin Linux Fileshare CFC Plugin Netskope Plugins: Netskope Forwarder/Receiver EDM Plugin Netskope EDM Plugin Netskope CFC Plugin EDM and CFC Beta Modules Changed Core UI Enhanced the Setup script to mount the files-data folder under data folder to store and manage files temporary, and added the permission for the same. This can be used to store and manage files for EDM and CFC Modules. Added a restriction in the settings as EDM and CFC modules can not be enabled with other Cloud Exchange modules. Enhanced filtering capabilities into the query builder to support custom functions and query transformation support, which can be used to filter out file size with options to select the unit as KB, MB, or GB.", "Known Issues and Limitations for v6.0.0 During plugin configuration, the Previous button runs field validation and only goes back if all inputs are valid. During a manual sync in the Ticket Orchestrator Module, Cloud Exchange is making extra API calls to fetch users in the Jira and Managed Service Desk plugins. During HA setup using the env-based approach, Cloud Exchange setup is displaying a GlusterFS installation error, along with an OS compatibility error message for unsupported OS versions. In the Log Shipper dashboard, in the Alert/Event/Logs/WebTx Sent bar chart, the custom time range is not working for the WebTx data type. Known Issues, Behaviors, and Limitations for the EDM and CFC Beta Modules The EDM and CFC Beta modules have been validated only with the standalone containerized deployment of Cloud Exchange using Ubuntu 22.04 or RHEL 9.6 as the base operating system. The EDM and CFC modules do not support HA deployment or VM image–based standalone and HA deployments of Cloud Exchange. For Cloud Exchange v6.0.0, the EDM and CFC Beta modules do not support the Medium stack size. Only the Large containerized standalone instance is supported. In EDM, when a column name contains double-quotes (“), it failes if that column is selected as a Name Column for Sanitization. In EDM, while uploading hashes to the Netskope Tenant, when you encounter a 429 status code (Too many requests), the current upload workflow does not handle retries or residue cleanup.", "Published on: December 15, 2025 We are excited to announce our release updates! Get the latest features, issues fixed, and other updates in this release. Deployments occur over a one-week window. If you do not see this feature in your tenant immediately, please wait until the deployment period has concluded. To check your tenant software version, navigate to Settings > General . The Inline App Connector release AC-133.0.0 includes the following releases: AC-132.0.1 AC-132.1.0 AC-132.1.1 AC-133.0.0 Release Notes Subscription Would you like to subscribe to our release notes? To learn more: Release Notes Subscription . Upcoming Product Changes To preview some of what's coming in the next release, see: Product Change Notification .", "Release AC-133.0.0 new features and enhancements. New Features and Enhancements Github Suite A new GitHub Suite is defined for the following apps: GitHub GitHub Copilot AI Security Guardrails With this release AI Security Guardrails for prompts and responses are enabled for the following applications: ChatGPT Microsoft Copilot Microsoft 365 Copilot Google Gemini GitHub Copilot Amazon Bedrock To learn more: AI Security Guardrails Microsoft 365 Copilot Image File Type Enhancement Added support for image file uploads with DLP protection for Microsoft 365 Copilot. New Activities There’s a behavior change for Response activities added for the Generative AI applications below. When a policy is configured with a ‘Block’ action that matches violating content in a single response packet, the entire conversation history is blocked when the user attempts to refresh the application or toggle to a different conversation. -ChatGPT -Microsoft Copilot -Microsoft 365 Copilot -Google Gemini -Grok AI New Application Support for Grok AI Added support for the new Grok AI application. The following are supported activities: Upload Download Post Response Create Edit Delete Share Login Attempt Login Successful Login Failed Logout Google Search AI Mode: Support Activity Detection Added new app connector support for Google Search AI Mode. The following activities are added for DLP support: Post Upload This feature must be enabled. Contact your Netskope Sales or Support team to enable it in your account. Google NotebookLM Enterprise Added new app connector support for the Google NotebookLM Enterprise application. The following activities are supported: Create Edit Delete Rename Generate Upload Share Post Response Domo Added support for Download activity detection of Domo dashboards embedded within other web applications via iframes. Microsoft Viva Engage Added activity detection support when deleting a Post form dashboard in Microsoft Viva Engage. Github Copilot Added Response activity with DLP support for GitHub Copilot, for Browser", "Share Post Response Domo Added support for Download activity detection of Domo dashboards embedded within other web applications via iframes. Microsoft Viva Engage Added activity detection support when deleting a Post form dashboard in Microsoft Viva Engage. Github Copilot Added Response activity with DLP support for GitHub Copilot, for Browser and Native. Google Gemini Added Response activity support with DLP for Google Gemini. ChatGPT We have added DLP inspection support for ChatGPT LLM text responses through a new activity type called “Response,” applicable only to users logged in to ChatGPT. Microsoft 365 Copilot and Microsoft Copilot User interaction with Copilot from Microsoft Excel, Word, PowerPoint, Teams, and Outlook is detected as AI Post Activity in Microsoft 365 Copilot and Microsoft Copilot. AI Post activity support must be enabled. Contact your Netskope Sales or Support team to enable it in your account. Navigations are listed below for both Microsoft 365 Copilot and Microsoft Copilot: MS Word – Click Draft with Copilot for MS Word MS Excel – Select any content and click Copilot Suggestions MS PowerPoint – Create a presentation with Copilot MS Teams – Rewrite with Copilot in Teams Chat/Channels MS Outlook – Rewrite Email with Copilot Copilot Chat window from MS Word, Excel, Powerpoint, Teams, Outlook – Prompts are already detected as “Post” activity with existing support and no feature enablement is required. Any response from CoPilot that users “Insert” in the document is covered under ODFB and SharePoint Edit activity with DLP/TSS Support. Microsoft 365 Copilot and Microsoft Copilot Responses generated for user prompts are detected as Response Activity in Microsoft 365 Copilot and Microsoft Copilot. Microsoft Copilot – the instance_id is shown as “personal’ Microsoft 365 Copilot – the instance_id is shown as the user email domain. This feature must be enabled. Contact your Netskope Sales or", "Copilot Responses generated for user prompts are detected as Response Activity in Microsoft 365 Copilot and Microsoft Copilot. Microsoft Copilot – the instance_id is shown as “personal’ Microsoft 365 Copilot – the instance_id is shown as the user email domain. This feature must be enabled. Contact your Netskope Sales or Support team to enable it in your account. AWS Bedrock LLM Added “AI Response” activity support with DLP for the AWS Bedrock platform. New Domains Grammarly Added a new domain, grammarly.io to the Grammarly application. Microsoft Forms Added a new domain, ‘forms.cloud.microsoft’ for Microsoft Forms. Google Maps With this release a new domain, mobilemaps.googleapis.com is added to the Google Maps application definition. Rediffmail With this release a new domain, f5email.rediff.com is added to the Rediffmail application definition. Microsoft Intune The following Microsoft Intune domains are added for SSL bypassing. do.dsp.mp.microsoft.com update.microsoft.com adl.windows.com dl.delivery.mp.microsoft.com tsfe.trafficshaping.dsp.mp.microsoft.com time.windows.com,s-microsoft.com windowsphone.com azureedge.net notify.windows.com wns.windows.com ekcert.spserv.microsoft.com ekop.intel.com ftpm.amd.com monitor.azure.com support.services.microsoft.com trouter.communication.microsoft.com trouter.skype.com trouter.teams.microsoft.com api.flightproxy.skype.com ecs.communication.microsoft.com edge.microsoft.com edge.skype.com remoteassistanceprodacs.communication.azure.com remoteassistanceprodacseu.communication.azure.com remotehelp.microsoft.com wcpstatic.microsoft.com lgmsapeweu.blob.core.windows.net webpubsub.azure.com gov.teams.microsoft.us remoteassistanceweb.usgov.communication.azure.us config.edge.skype.com fd.api.orgmsg.microsoft.com ris.prod.api.personalization.ideas.microsoft.com windowsupdate.com clientconfig.passport.net displaycatalog.mp.microsoft.com purchase.md.mp.microsoft.com licensing.mp.microsoft.com storeedgefd.dsx.mp.microsoft.com cdn.storeedgefd.dsx.mp.microsoft.com events.data.microsoft.com", "FIX VERSION APP NAME PLATFORM ACTIVITY DESCRIPTION RELEASE DATE AC-132.0.1 Grammarly Browser Create, Delete, Download Addressed an activity detection issue for download file, delete file, and restore file navigation. Nov 17, 2025 Salesforce.com Browser Create, Edit, Rename Addressed an object value display issue in event details. Nov 17, 2025 AC-132.1.0 Microsoft Live Outlook Browser Upload Addressed DLP functionality issue. Dec 2, 2025 Microsoft Dynamics CRM Online Browser Upload Addressed a file download issue where the file contents was empty. Dec 2, 2025 AC-132.1.1 ChatGPT Browser Login Attempt Addressed a missing from_user issue due to traffic changes. Dec 12, 2025 AC-133.0.0 ChatGPT Browser Upload Addressed an instance mismatch issue for file uploads. Dec 18, 2025 Microsoft 365 Copilot Browser Response Addressed a from_user/instance_id extraction failure Dec 18, 2025 Microsoft Office 365 OneDrive for Business Browser Edit Addressed a from-object, to-object attribute issue. Dec 18, 2025 Atlassian Confluence Browser Delete, Download Addressed an incorrect instance_id issue for activity detection. Dec 18, 2025 Google Sites Browser Create, Download, Rename, Upload Addressed a missing instance_id and from_user issues. Dec 18, 2025 Salesforce Browser Download Addressed an incorrect instance_id extraction logic. Dec 18, 2025 Adobe Creative Cloud Browser, Native Download, Upload Addressed a false positive events issue. Dec 18, 2025 Yahoo App Suite Browser Login Failed, Login Successful Addressed an activity detection issue due to traffic changes. Dec 18, 2025 WeTransfer Browser Share Addressed an activity detection issue. Dec 18, 2025 Amazon Elastic Load Balancing Browser Deregister, Register Addressed Register and Deregister activity detection issues. Dec 18, 2025 HubSpot Browser Create, Upload Addressed activity detection issue while creating a ticket and uploading a file. Dec 18, 2025 Dropbox Browser Download Addressed an activity detection issue for Dropbox Installer download. Dec 18, 2025 Facebook Browser Login Successful, Login Failed Addressed an activity detection issue due to", "Dec 18, 2025 HubSpot Browser Create, Upload Addressed activity detection issue while creating a ticket and uploading a file. Dec 18, 2025 Dropbox Browser Download Addressed an activity detection issue for Dropbox Installer download. Dec 18, 2025 Facebook Browser Login Successful, Login Failed Addressed an activity detection issue due to traffic changes. Dec 18, 2025 GitHub Browser Create Addressed an activity detection issue while creating an issue. Dec 18, 2025 Microsoft Office 365 OneDrive for Business Native Upload Addressed multiple event issues. Dec 18, 2025 Microsoft 365 Copilot Browser Upload Added support for image file upload. Dec 18, 2025 Amazon Bedrock Browser, Native AI Post, AI Response Added Response activity support with DLP. Dec 18, 2025 Microsoft 365 Copilot Browser Response Added Response activity support. Dec 18, 2025 Backlog Browser Upload, Download, Delete Addressed activity detection issues observed for file upload, download, and delete navigation. Dec 18, 2025 Instagram Browser Like, Create, View, Edit Addressed an activity detection issue. Dec 18, 2025 Youtube Browser View Addressed a video playback bypassing block policy issue on page refresh. Dec 18, 2025 DocuSign Browser Create, Delete, Download, Edit, Login Attempt, Login Failed, Login Successful, Logout, Rename, Send, Upload, View, View All Addressed a shared credential issue. Dec 18, 2025 Jira, Confluence Browser AI Post Addressed an activity detection issue. Dec 18, 2025 Salesforce.com Browser Create, Edit, Delete, Rename Addressed an object value issue. Dec 18, 2025", "ISSUE NUMBER DESCRIPTION 773974 DLP input normalization (markdown processing) is not active for Amazon Bedrock; therefore, DLP only functions with plain text in both AI Post and AI Response activities. TSS currently does not support file/attachment upload or download activities for Bedrock. 830261 Microsoft 365 Copilot and Microsoft Copilot: There are multiple block events (3-4) generating for AI Post activity for Block policies. 733393 For the Gemini app, if a block policy is applied to the Response, the DLP content is blocked upon page refresh. However, the user will not receive the response of the first prompt sent after the page is refreshed. To get the response, the user must either stop the response or refresh the page again.", "These are the new features and enhancements with NPA: Private Access Cloud NPA Source IP Egress Criteria for Client Private Access now supports source IP (Egress IP) as a criteria in policy for NPA applications steered via the Client access method. Mixed Content Private Apps We’re improving Enterprise Browser support for Private Apps to handle pages that mix secure and insecure content. This update helps internal apps load fully and safely without requiring customers to rework legacy components. Summary . Improved reliability: Pages with mixed content now render consistently in Enterprise Browser. Admin-friendly: Simple per-app control in Private App settings. Security by default: Insecure resources are upgraded to secure requests when possible. Key Changes Simple enablement: Controlled via Private App settings; no major architecture changes required. Periodic Authentication for Real-time Policy Framework Netskope Private Access introduces a new feature for per-app authentication as part of Real-Time policy controls. Customers can now define authentication requirements based on a wide range of source and destination criteria and configure the appropriate timer. Whenever a user tries to access, the user will receive a customizable End-User Notification and afterwards be requested to authenticate or re-authenticate. We recommended you use Per App Authentication or Device Level Reauthentication instead of both. Supported minimum Client version: 131.0.0 Updated the NPA Tunnel Re-auth Behavior If NPA re-authentication is triggered when Windows Desktop is in hibernate mode (AOAC support), users had to refresh a authentication window with a session expired error on wake-up. Netskope Private Access is now aware of system status and ensures a clean refreshed authentication is started on wake up. Supported minimum Client version: 133.0.0 NPA Data Plane Publisher Gateway (Stitcher) Performance Improvements Improved the Netskope NPA Data Plane Publisher Gateway (Stitcher) to process faster and scale better for high-demand workloads, increasing overall performance. Since R133,", "of system status and ensures a clean refreshed authentication is started on wake up. Supported minimum Client version: 133.0.0 NPA Data Plane Publisher Gateway (Stitcher) Performance Improvements Improved the Netskope NPA Data Plane Publisher Gateway (Stitcher) to process faster and scale better for high-demand workloads, increasing overall performance. Since R133, this improvement has been rolled out to specific Data Planes and will extend to all Data Planes in upcoming releases. Publisher Software Version: 133.0 Supported Publisher Versions: 133.0, 132.0, and 131.0. General Availability Date: December 10, 2025 Updated Kernel Versions Platform Kernel Version OVA VHDX AMI VHD 5.15.0-161-generic 6.8.0-1041-azure 6.5.0-1024-aws 6.8.0-1041-azure SHA Hash for Publisher Images Image Type SHA256 OVA 5b6938ae609327c4b86bfb0d676dc82331e21321b4c39951116d6052fde7ecac VHDX dd34595dd0afcaa88f69f75db33ad67d1626c8ee577ec08ec831d15d1b14acb3 OVA/VHDX Hosting on the Alicloud OVA hosting on the AliCloud: https://npa-ova.oss-cn-shenzhen.aliyuncs.com/latest/NetskopePrivateAccessPublisher.ova VHDX hosting on the AliCloud: https://npa-ova.oss-cn-shenzhen.aliyuncs.com/latest/NetskopePrivateAccessPublisher.vhdx Enhanced Publisher bind9 Settings This change improved container stability by retrying to retrieve the DNS servers from /etc/hosts on the host OS. Local Broker Software Version: 133.0 Supported Local Broker Versions: 133.0 and 131.0. General Availability Date: December 16, 2025 Restrict Local Broker Name Change Starting with release R133, the tenant user interface restricts changes to the Local Broker name after the initial configuration save. POP Name in Network Events Prior to this release, Network Events generated from a Local Broker did not show the pop_name . With this enhancement, all Network Events generated from a Local Broker will show the pop_name as a keyword prefixed to the Local Broker name.", "These are the fixed issues with NPA: Private Access Cloud The Private Access fixed issues in this release are: Issue Number Description 699689 The upgrade process of the Local Broker did not consistently clear old images from the cache. This issue has been resolved in R133 and old images are now successfully removed after the upgrade. 707092 Customers had difficulty tracking configuration changes to NPA object like Private Apps, Publishers, and Local Brokers. The audit logs were emitting object IDs of Private Apps, Publishers, and Local Brokers instead of object names on configured events. This has been resolved as part of this release. 742942 Refreshed NPA Objects and Resources terminology in the WebUI to align with widely adopted industry terminology. 787126 When the SWG tunnel is in Fail Close mode and Secure DNS is enabled, it bypasses all DNS queries, including those for Private Apps. This causes the NPA prelogon tunnel to fail in processing DNS queries for Private Apps. This has been resolved by excluding all Private App DNS queries from this bypass. 794584 Resolved a issue on multi-user desktops based on Citrix VDI Windows 2016 causing potential instability. Publisher The Publisher fixed issue in this release are: Issue Number Description 787785 This release addresses high CPU usage in the NoNAT Publisher caused by incorrect error handling of zero-length UDP packets. Local Broker The Local Broker fixed issue in this release are: Issue Number Description 699689 Prior to the release of R133, the upgrade process of the Local Broker did not consistently clear old images from the cache. This issue has been resolved in R133, where users will now receive a STDOUT message indicating that the old images have been successfully removed after the upgrade.", "This release provides several improvements for Netskope’s on-premises Cloud Access Security Broker (CASB), such as new features, enhancements, known issues, and fixed issues. Overview for On-Premises Appliance Version 121.0.0 The N2000 and N5000 appliances provide the physical footprint to process and maintain data inside an enterprise’s perimeter. Note The N1000, N5000, and N10000 appliances are no longer available for purchase. Netskope continues to support software upgrades on existing N1000, N5000, and N10000 appliances. The N2000 appliance hardware has been revised and comes preloaded with Appliance software version 121.0.0. The following are the specifications of the new appliance hardware. Interface Ports Speed IPMI 1g eth0 Management 1g eth1 Aux1 1g eth2 Tap 1g eth3 Aux2 1g eth4 Out (Outbound) 10g eth5 In (Inbound) 10g The following are the specifications of the old appliance hardware. N2000 N5000 Series II CPU Dual 16 core Dual 10 core Memory 512 GB DDR4 768 GB DDR4 Storage 4x 1.2 TB Intel SSD 12x 1.2 TB SSD I/O (2x 10gbe), 1x gbe ipmi, 1x gbe mgmt, 3x gbe (2x 10gbe) 1x gbe ipmi, 1x gbe mgmt, 3x gbe Power Dual redundant 800W Dual redundant 750W Note To move to version 121.0.0, you must be running a minimum version 113.0.0 since Netskope supports upgrades up to two versions prior to the current version. To learn more about the appliance: Overview of Netskope On-Premises Appliance . Appliance Software Version Support Netskope Appliance software releases are available every 4-months and will have Netskope support up to two previous versions. Direct software upgrades are supported as long as the “from” and “to” software releases are within two versions apart. Netskope appliance releases are numbered in the form of X.X.X.X where the Xs represent the major, minor, hotfix, and build release numbers, respectively. For example, appliance release 110.0.0 and older releases", "Direct software upgrades are supported as long as the “from” and “to” software releases are within two versions apart. Netskope appliance releases are numbered in the form of X.X.X.X where the Xs represent the major, minor, hotfix, and build release numbers, respectively. For example, appliance release 110.0.0 and older releases are deprecated when appliance release 121.0.0 goes live. Release numbers are not sequential like 101, 102, and 103. Instead, release numbers jump numerically, like 113.0.0, 117.0.0, and 121.0.0, to reflect parity with the Netskope Cloud Releases. The following table provides the upgrade path to the latest software version. Current version Upgrade to version Any version before 113.0.0 113.0.0 113.0.0 121.0.0 117.0.0 121.0.0 Releases that are outside the Netskope support period: Are not guaranteed to work with the latest cloud releases. Are no longer tested by Netskope. Do not receive hotfixes. Do not receive new feature updates. At our discretion, we may provide support for releases outside our support period. If a customer encounters an error in a version of software that is other than the latest release, Netskope may require the customer to upgrade to a specified later version to obtain a correction of the error. Netskope MIB File The following is the Netskope MIB file for 121.0.0: NETSKOPE-APPLIANCE-MIB-APL121 Download", "New Features and Enhancements for On-Premises Appliance Version 121.0.0 New Threatfeed Package for Appliances A new threatfeed package is now available for installation. Note that: When you upgrade to Appliance version 121.0.0, you must install the new threatfeed package after the upgrade. Upgrading to this release will delete the old threatfeed package. To install the new threatfeed package: If you configure the auto-upgrade for the threatfeed package before the appliance upgrade, this configuration will be retained after the appliance upgrade. If you don’t configure the auto-upgrade, the installation of the threatfeed package will occur approximately 10 minutes after enabling OPLP or DPOP mode. Alternatively, you can manually upgrade the threatfeed package instead of waiting for the auto-upgrade to initiate. Auto-Upgrade for DPOP & OPLP Added support for auto-upgrades for the DPOP and OPLP packages. Contact Netskope Support or your sales representative to enable this feature. Username & Password for the KMIP Server Added the ability to configure a username and password for the KMIP server. Configure Multiple Listening Ports for DPOP DPOP now supports listening for traffic on multiple ports instead of a single port. To learn more, see Configure the Appliance in Explicit Proxy Mode . Deprecation for DNS Proxy for DPOP Netskope will no longer support DNS proxy mode for DPOP. TCP Keepalives Support for DPOP Introduced the ability to increase TCP keepalives from the NS proxy to the web server for specific domains. Note You must provide the server domains to use this feature. Contact Netskope Support to enable and configure this feature.", "Fixed Issues for On-Premises Appliance Version 121.0.0 The following fixed issues are included in this release. Issue Number Issue Description 476993 Publishing metrics from the Appliance platform could be disabled. Fixed. 503376 Netmask notation is supported in the ssh-allowlist. Fixed. 540238 The High Availability (HA) status for Appliance was not visible on the CLI or via the SNMP. Fixed.", "Release Date: December 8, 2025 This release provides several improvements for Netskope’s Virtual Appliance, such as new features, enhancements, known issues, and fixed issues. Requirements for Virtual Appliance Version 132.0.0 Upgrading to version 132.0.0 Before downloading the upgrade package, ensure the following: You are running a minimum version of 124.0.0.125. If you are running appliance versions older than 124.0.0.125, or if the root (/) partition is less than 64 GB, you must deploy a new Virtual Appliance and import configurations from the old appliance. To learn more: Install a Virtual Appliance . Note If your Virtual Appliance uses a 64 GB root (/) partition, then you must ensure that at least 8 GB of free space is available before upgrading. There is at least 42 GB of free space on the /opt/ns/upgrades partition where the upgrade package is downloaded. You can delete older versions of the appliance from the upgrades folder to free up disk space. To learn more: Upgrade the Virtual Appliance . All the dhcp interfaces on the appliance are configured with a static IP, netmask and gateway. Export the current appliance configurations to a different host. To learn more: Exporting Configurations . To verify that the host is reachable, run the following telnet command. nsappliance> telnet host cz.archive.ubuntu.com port 80 Executing telnet as: ['telnet', 'cz.archive.ubuntu.com', '80'] Trying 217.31.202.63... Connected to mirror-r-01.nic.cz. Escape character is '^]'. The following are the minimum hardware requirements to install and run the Virtual Appliance. Component Requirements Physical RAM 32 GB Processor 8-Core Hard disk space 450 GB is the total disk space required across all partitions. This includes 96 GB for storing and processing logs and 304 GB for the root partitions which store the Netskope software, configuration files, and data files. You must increase the disk capacity depending on the size", "Hard disk space 450 GB is the total disk space required across all partitions. This includes 96 GB for storing and processing logs and 304 GB for the root partitions which store the Netskope software, configuration files, and data files. You must increase the disk capacity depending on the size of the logs that are processed daily. For information on increasing the partition size, see “Increase the Size of the Partition” under Optional Configurations topic on the Knowledge Portal . Note Netskope recommends that you increase the disk capacity by 5 times the expected daily log collection size. Appliance Software Version Support Netskope Appliance software releases are available every 4-months and will have Netskope support up to two previous versions. Direct software upgrades are supported as long as the “from” and “to” software releases are within two versions apart. Netskope appliance releases are numbered in the form of X.X.X.X where the Xs represent the major, minor, hotfix, and build release numbers, respectively. For example, appliance release 110.0.0 and older releases are deprecated when appliance release 132.0.0 goes live. Release numbers are not sequential like 101, 102, and 103. Instead, release numbers jump numerically, like 124.0.0.125, 128.0.0, and 132.0.0, to reflect parity with the Netskope Cloud Releases. The following table provides the upgrade path to the latest software version. Current version Upgrade to version Any version before 124.0.0.125 124.0.0.125 124.0.0.125 132.0.0 128.0.0 132.0.0 Releases that are outside the Netskope support period: Are not guaranteed to work with the latest cloud releases. Are no longer tested by Netskope. Do not receive hotfixes. Do not receive new feature updates. At our discretion, we may provide support for releases outside our support period. If a customer encounters an error in a version of software that is other than the latest release, Netskope may require", "Are no longer tested by Netskope. Do not receive hotfixes. Do not receive new feature updates. At our discretion, we may provide support for releases outside our support period. If a customer encounters an error in a version of software that is other than the latest release, Netskope may require the customer to upgrade to a specified later version to obtain a correction of the error. Hash Values for Virtual Appliance Installation Files The following table provides the md5sum and sha256sum values for the Virtual Appliance installer files on VMware ESX, Microsoft Hyper-V, and Linux KVM platforms for version 132.0.0. File Type md5sum sha256sum ESX OVA 6e5a0ed722798efc41bab11338291092 e14d44df08e72d454955e2542bfe0b3ae6e5f3c59052468c15601e509a2da221 Hyper-V Image 2d93cf428eb7cf58b78e69acc1f3b405 39e488564719472278be994ba760630edf40467ce0b5044a2055ea85dfd5164c KVM Image 6ac7e6eb0e042fbec1036a5e77b003d2 b18b4107a9536779674418b0aa90dc32ee6b51912ebab47c580437fabed28f05 Netskope MIB File The following is the Netskope MIB file for 132.0.0: APL-R132 NETSKOPE-APPLIANCE-MIB Download", "Here is the list of the new features and enhancements in this release. New CLI Command for Appliances The new CLI command set dns cache-ttl allows you to manually configure the DNS cache TTL on the appliance. With this command, you can configure a maximum cache TTL, in seconds. The default cache TTL is 5 minutes for the A record and 1 minute for the CNAME. If the upstream server returns a TTL that is higher for a given host or CNAME, then the appliance will honor the configured maximum cache TTL.", "Here is the list of fixed issues in this release. Issue Number Issue Description 699866 If forward proxy was enabled before installing the threatfeed package, malsite alerts do not trigger. Fixed. 746578 There was a bug affecting the status log-file-history command. Fixed. 751780 Using reset retain-network resulted in the error: “Failed to reset securestore password, aborted reset\" . Fixed. 755343 There was a timeout issue when displaying the remote package list on the appliance Increased the timeout between Appliances and Netskope Cloud when displaying the list. 768374 A capacity issue in the boot partition caused upgrades to Appliances release 128 to fail on appliances (introduced with release 113) that originally shipped with a 150MB boot partition. These older systems don’t have enough space to unpack the new image during an upgrade, which led to unpack errors and halted the process. This release delivers a fix that ensures the upgrade workflow can complete successfully even on appliances with the smaller, legacy boot partition. 771305 After upgrading the appliance, a timezone synchronization issue could cause auto-upgrade to fail after the downloading phase. Fixed. 773072 There was an issue in the auto-upgrade process caused by status command checks. Fixed. 773958 The status log-file-history command sometimes reported inaccurate log processing time statistics for large log files. The status log-file-history command now reports accurate statistics. 774243 Auto-upgrades might fail intermittently. Fixed. 781623 RADIUS users were constrained by password policies on the appliance instead of being managed externally. RADIUS users are now exempted from appliance password policies. 787317 The status was implemented with the following behavior: The transition state could take up to 5 minutes to update on the CLI status. This was because, internally, the status file was updated every 5 minutes. The status transition data showed the last 5 state transitions and a global", "policies. 787317 The status was implemented with the following behavior: The transition state could take up to 5 minutes to update on the CLI status. This was because, internally, the status file was updated every 5 minutes. The status transition data showed the last 5 state transitions and a global state transition counter. None of these values were reset. The status all command was enhanced to show the short details of the last HA state transitions. 803074 The DPOP NSProxy showed high RSS usage that increased over time and residual connections were seen even when there was no traffic flow. In addition, nswatson -p 3214 -c “show stats httpmod” showed non-zero flows. If the client terminated the connection by sending FIN/RST after a HTTP request was sent to the server, it would not be forwarded to the server until the server responded. If for some reason the server didn’t respond, then the connection was never cleaned up, leading to half-closed connections. As a solution, use the following commands: \"send-fin-to-back-timer-enabled\": true, \"send-fin-to-back-timeout\": 300 // seconds After receiving the FIN/RST from the front connection, a timer of 300 seconds starts. After this time expires, Netskope sends the FIN back to the back connection to clear the connection."]